// import { IButtonMenu, IDomEditor } from '@wangeditor/editor'
const previewMenu = {
    key: 'preview', // 定义 menu key ：要保证唯一、不重复（重要）
    factory() {
        return new previewButton() // 把 `YourMenuClass` 替换为你菜单的 class
    },
}
class previewButton {
    constructor() {
        this.tag = 'button'
        this.title = '预览' // 自定义菜单标题
        this.iconSvg = `<svg t="1691733017877" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1456" width="200" height="200"><path d="M511.6 653.3c81.7 0 157.5-42.1 229.7-130.7-72.2-89-148-131.2-229.7-131.2s-157.5 42.1-229.7 130.7c72.2 89 148 131.2 229.7 131.2z m0 62.1c-105.4 0-201.3-53.7-288.7-160.7-15.3-19-15.3-45.8 0-64.8C309.8 383 406.2 329.3 511.6 329.3S712.8 383 800.3 490c15.3 19 15.3 45.8 0 64.8C712.8 662.2 617 715.4 511.6 715.4z" p-id="1457"></path><path d="M511.6 550.5c15.3 0 27.9-12.6 27.9-27.9 0-15.3-12.6-27.9-27.9-27.9s-27.9 12.6-27.9 27.9c0 15.3 12.1 27.9 27.9 27.9z m0 71.7c-35.8 0-68.5-19-86.4-50-17.9-31.1-17.9-69 0-100.1 17.9-31.1 51.1-50 86.4-50 55.3 0 100.1 44.8 100.1 100.1s-44.8 100-100.1 100z m-378 268.2l1.9-135c0-20-16.3-35.8-35.8-35.8-20 0-35.8 16.3-35.8 35.8v154.9c0 33.2 26.9 60.1 60.1 60.1h154.9c20 0 35.8-16.3 35.8-35.8s-16.3-35.8-35.8-35.8l-134.5 1.4c-5.7 0.1-10.4-4.2-10.8-9.8z m8.9-743.9h135.7c20 0 35.8-16.3 35.8-35.8 0-20-16.3-35.8-35.8-35.8H123.3c-33.2 0-60.1 26.9-60.1 60.1v154.9c0 20 16.3 35.8 35.8 35.8 20 0 35.8-16.3 35.8-35.8V154.1c0.1-4.2 3.5-7.6 7.7-7.6z m744.7 5.5v137.2c0 21.1 18.1 37.5 38.9 35.7 18.6-1.6 32.7-17.6 32.7-36.3V134.3c0-33.2-26.9-60.1-60.1-60.1H743.9c-20 0-35.8 16.3-35.8 35.8 0 20 16.3 35.8 35.8 35.8h137.2c3.4 0.1 6.1 2.9 6.1 6.2z m-9.7 746.3h-133c-21.1 0-37.5 18.1-35.7 38.9 1.6 18.6 17.6 32.7 36.3 32.7h154.2c33.2 0 60.1-26.9 60.1-60.1V755c0-21.1-18.1-37.5-38.9-35.7-18.6 1.6-32.7 17.6-32.7 36.3v132.6c0 5.6-4.5 10.1-10.1 10.1h-0.2z" p-id="1458"></path></svg>` // 可选
    }

    // 获取菜单执行时的 value ，用不到则返回空 字符串或 false
    getValue(editor) {
        return !editor.getConfig().preview
    }

    // 菜单是否需要激活（如选中加粗文本，“加粗”菜单会激活），用不到则返回 false
    isActive(editor) {
        return false
    }

    // 菜单是否需要禁用（如选中 H1 ，“引用”菜单被禁用），用不到则返回 false
    isDisabled(editor) {
        return false
    }

    // 点击菜单时触发的函数
    exec(editor, value) {
        console.log(editor.getConfig());
        this.iconSvg = ''
        // 预览属性是否可见
        editor.getConfig().preview = value
        editor.onChange()

        if (this.isDisabled(editor)) return
        editor.insertText(value) // value 即 this.value(editor) 的返回值
    }
}
export { previewMenu }