<template>
    <div class="app-content-center">
        <div class="container">
            <svg xmlns="http://www.w3.org/2000/svg" width="500" height="500" viewBox="0 0 500 500">
                <path id="tuzi"
                    d="m 323.02844,57.389256 -52.34907,3.885043 -83.17686,59.940651 -70.96207,7.77009 -48.859137,69.93076 94.228327,70.48577 -33.1544,18.31519 6.39821,12.21014 -16.28638,14.98516 h 29.08282 l 28.50116,14.43016 50.6041,-1.11002 38.38931,45.5105 -71.54372,33.85537 25.59288,3.88504 -19.19466,14.43016 186.71168,1.11001 13.3781,-35.52039 46.53251,9.99012 -25.01122,-72.7058 -29.08282,-44.40048 -142.5058,-74.37081 -47.11416,-57.72063 162.28211,-15.54017 -89.57507,-34.41037 z" />
                <text>
                    <textPath xlink:href="#tuzi" class="textPath">
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;兔年大吉&nbsp;&nbsp;&nbsp;&nbsp;
                        <animate attributeName="startOffset" from="0" to="68" begin="0s" dur="3s"
                            repeatCount="indefinite" />
                    </textPath>
                </text>
            </svg>

            <svg xmlns="http://www.w3.org/2000/svg" width="0" height="0" viewBox="0 0 500 500">
                <clipPath id="clip-path">
                    <path
                        d="m 323.02844,57.389256 -52.34907,3.885043 -83.17686,59.940651 -70.96207,7.77009 -48.859137,69.93076 94.228327,70.48577 -33.1544,18.31519 6.39821,12.21014 -16.28638,14.98516 h 29.08282 l 28.50116,14.43016 50.6041,-1.11002 38.38931,45.5105 -71.54372,33.85537 25.59288,3.88504 -19.19466,14.43016 186.71168,1.11001 13.3781,-35.52039 46.53251,9.99012 -25.01122,-72.7058 -29.08282,-44.40048 -142.5058,-74.37081 -47.11416,-57.72063 162.28211,-15.54017 -89.57507,-34.41037 z" />
                </clipPath>
            </svg>

            <div class="text-box">
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年来到，福兔祝你鸿福齐天，万事如意；祥兔祝你财气冲天，好运无穷；吉兔祝你吉星高照，心想事成；灵兔祝你天天开心，福寿安康；朋友则祝你兔年如意，万事顺心！春风舞春晓，玉兔满街跑。蹦蹦又跳跳，运气步步高。耳朵摇摇摇，广进金元宝。尾巴翘翘翘，甩掉愁烦恼。妙声吱吱吱，福禄寿喜到。祝你兔年：好好好！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年来到，福兔祝你鸿福齐天，万事如意；祥兔祝你财气冲天，好运无穷；吉兔祝你吉星高照，心想事成；灵兔祝你天天开心，福寿安康；朋友则祝你兔年如意，万事顺心！春风舞春晓，玉兔满街跑。蹦蹦又跳跳，运气步步高。耳朵摇摇摇，广进金元宝。尾巴翘翘翘，甩掉愁烦恼。妙声吱吱吱，福禄寿喜到。祝你兔年：好好好！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年来到，福兔祝你鸿福齐天，万事如意；祥兔祝你财气冲天，好运无穷；吉兔祝你吉星高照，心想事成；灵兔祝你天天开心，福寿安康；朋友则祝你兔年如意，万事顺心！春风舞春晓，玉兔满街跑。蹦蹦又跳跳，运气步步高。耳朵摇摇摇，广进金元宝。尾巴翘翘翘，甩掉愁烦恼。妙声吱吱吱，福禄寿喜到。祝你兔年：好好好！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年来到，福兔祝你鸿福齐天，万事如意；祥兔祝你财气冲天，好运无穷；吉兔祝你吉星高照，心想事成；灵兔祝你天天开心，福寿安康；朋友则祝你兔年如意，万事顺心！春风舞春晓，玉兔满街跑。蹦蹦又跳跳，运气步步高。耳朵摇摇摇，广进金元宝。尾巴翘翘翘，甩掉愁烦恼。妙声吱吱吱，福禄寿喜到。祝你兔年：好好好！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
                兔年来到，福兔祝你鸿福齐天，万事如意；祥兔祝你财气冲天，好运无穷；吉兔祝你吉星高照，心想事成；灵兔祝你天天开心，福寿安康；朋友则祝你兔年如意，万事顺心！春风舞春晓，玉兔满街跑。蹦蹦又跳跳，运气步步高。耳朵摇摇摇，广进金元宝。尾巴翘翘翘，甩掉愁烦恼。妙声吱吱吱，福禄寿喜到。祝你兔年：好好好！
                兔年的礼花绽放在浩瀚夜空，璀璨无比。炮竹声声唱响了兔年的风采，喜乐羊羊。窗花贴出了兔年的丰收景象，三羊开泰。红对联洋溢着兔年的吉祥，万事如意。愿你兔年兔兔兔，喜悦乐淘美美美！
            </div>
        </div>
    </div>
</template>

<style lang="scss" scoped>
.container {
    width: 500px;
    height: 500px;
    position: relative;
}

.text-box {
    position: absolute;
    width: 100%;
    height: 100%;
    top: 0;
    left: 0;
    //   background: blue;
    clip-path: url("#clip-path");
    z-index: -1;
    font-size: 12px;
    line-height: 22px;
    color: #e76262;
    transform-origin: 50% 50%;
    overflow: hidden;
}

#tuzi {
    fill: transparent;
}

.textPath {
    fill: red;
    font-size: 10px;
    letter-spacing: 2px;
    stroke: red;
    stroke-width: 1px;
}
</style>